Tekla Open API Reference for Tekla Structures 2025
Distance.ToString Method (String, IFormatProvider)
 Creates a string representation of the distance.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ToString(
	string format,
	IFormatProvider formatProvider
)
Public Function ToString (
	format As String,
	formatProvider As IFormatProvider
) As String
Parameters
format
Type: System.String
The format string.
formatProvider
Type: System.IFormatProvider
The number format provider.
Return Value
Type: String
The string representation of the distance.
Implements
IFormattable.ToString(String, IFormatProvider)
Examples
 This example shows how to specify a number format and a format provider when converting a Distance instance to a string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
       public void Example1()
       {
           // For this demonstration, we'll format 300.2 millimeters.
           Distance distance = new Distance(300.2);
           string formattedString = distance.ToString("0.00", CultureInfo.InvariantCulture);
       }
}
See Also
Reference
Distance Structure
ToString Overload
Tekla.Structures.Datatype Namespace